Tekla Open API Reference for Tekla Structures 2025
RebarLapping Properties
The RebarLapping type exposes the following members.
Properties
Name | Description
LapLength
 Gets or sets the lap length. Negative values will define a gap rather than a lap.
LappingType
 Gets or sets the lapping type.
LapPlacement
 Gets or sets the placement of the lap relative to the associated RebarLegFace.
LapSide
 Gets or sets the side of the split that the lap is located.
Top
See Also
Reference
RebarLapping Class
Tekla.Structures.Model Namespace